---
permalink: data-protection/create-smb-server-task.html 
sidebar: sidebar 
keywords: cifs, create, smb, server 
summary: Si la SVM de origen tiene una configuración de SMB y decide establecer la conservación de identidad en false, se debe crear un servidor SMB para la SVM de destino. En algunas configuraciones SMB, como los recursos compartidos durante la inicialización de la relación de SnapMirror, es necesario el servidor SMB. 
---
= Cree un servidor SMB para una SVM de destino de ONTAP SnapMirror en una relación de recuperación ante desastres
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
Si la SVM de origen tiene una configuración de SMB y decide establecerse `identity-preserve` en `false`, debe crear un servidor SMB para la SVM de destino. Se necesita un servidor SMB para algunas configuraciones SMB, como los recursos compartidos durante la inicialización de la relación de SnapMirror.

.Pasos
. Inicie la SVM de destino con `vserver start` el comando.
+
[listing]
----
destination_cluster::> vserver start -vserver dvs1
[Job 30] Job succeeded: DONE
----
+
Obtenga más información sobre `vserver start` en el link:https://docs.netapp.com/us-en/ontap-cli/vserver-start.html["Referencia de comandos del ONTAP"^].

. Compruebe que la SVM de destino está en `running` estado y que el subtipo lo está `dp-destination` mediante `vserver show` el comando.
+
[listing]
----
destination_cluster::> vserver show
                                   Admin      Operational Root
Vserver  Type    Subtype           State      State       Volume     Aggregate
-------- ------- ----------       ---------- ----------- ---------- ----------
dvs1     data    dp-destination    running    running       -         -
----
+
Obtenga más información sobre `vserver show` en el link:https://docs.netapp.com/us-en/ontap-cli/vserver-show.html["Referencia de comandos del ONTAP"^].

. Cree una LIF mediante `network interface create` el comando.
+
[listing]
----
destination_cluster::>network interface create -vserver dvs1 -lif NAS1 -role data -data-protocol cifs -home-node destination_cluster-01 -home-port a0a-101  -address 192.0.2.128 -netmask 255.255.255.128
----
+
Obtenga más información sobre `network interface create` en el link:https://docs.netapp.com/us-en/ontap-cli/network-interface-create.html["Referencia de comandos del ONTAP"^].

. Cree una ruta mediante el `network route create` comando.
+
[listing]
----
destination_cluster::>network route create -vserver dvs1 -destination 0.0.0.0/0
-gateway 192.0.2.1
----
+
link:../networking/networking_reference.html["Gestión de redes"]

+
Obtenga más información sobre `network route create` en el link:https://docs.netapp.com/us-en/ontap-cli/network-route-create.html["Referencia de comandos del ONTAP"^].

. Configure DNS mediante `vserver services dns create` el comando.
+
[listing]
----
destination_cluster::>vserver services dns create -domains mydomain.example.com -vserver
dvs1 -name-servers 192.0.2.128 -state enabled
----
+
Obtenga más información sobre `vserver services dns create` en el link:https://docs.netapp.com/us-en/ontap-cli/search.html?q=vserver+services+dns+create["Referencia de comandos del ONTAP"^].

. Añada la controladora de dominio preferida mediante `vserver cifs domain preferred-dc add` el comando.
+
[listing]
----
destination_cluster::>vserver cifs domain preferred-dc add -vserver dvs1 -preferred-dc
192.0.2.128 -domain mydomain.example.com
----
+
Obtenga más información sobre `vserver cifs domain preferred-dc add` en el link:https://docs.netapp.com/us-en/ontap-cli/vserver-cifs-domain-preferred-dc-add.html["Referencia de comandos del ONTAP"^].

. Cree el servidor SMB mediante `vserver cifs create` el comando.
+
[listing]
----
destination_cluster::>vserver cifs create -vserver dvs1 -domain mydomain.example.com
-cifs-server CIFS1
----
+
Obtenga más información sobre `vserver cifs create` en el link:https://docs.netapp.com/us-en/ontap-cli/vserver-cifs-create.html["Referencia de comandos del ONTAP"^].

. Detenga la SVM de destino mediante `vserver stop` el comando.
+
[listing]
----
destination_cluster::> vserver stop -vserver dvs1
[Job 46] Job succeeded: DONE
----
+
Obtenga más información sobre `vserver stop` en el link:https://docs.netapp.com/us-en/ontap-cli/vserver-stop.html["Referencia de comandos del ONTAP"^].


